      ******************************************************************
      * Author: Camilo Ernesto Vargas Romero
      * Date: 09 - 01 - 2021
      * Purpose: Practice
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INICIO.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       PEIMER-RUTINA.
            DISPLAY "Hello world".
       SEGUNDA-RUTINA.
           DISPLAY "Hello world 2"
           STOP RUN.
       END PROGRAM INICIO.
