      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      *  Hay 4 tipos de palabras:
      *
      *  ->Reservadas
      *  ->Nombres del sistema
      *  ->Nombres de funciones
      *  ->Creadas por el usuario
      *
      *  Nunca podran superar los 31 caracteres 0-9  A-Z
      *
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
